{"pageProps":{"article":{"id":"3","lang":"kr","title":"웹3 게임 시장에서의 스팀","desc":"P2E 크립토 게임은 새로운 형태의 스팀이 필요합니다","keywords":"플레이투언, P2E, 크립토 게임, 웹3 스팀, 스팀 P2E, 스팀 NFT, 스팀 NFT, 스팀 토큰","path":"Next-Version-of-Steam-in-Web3-Gaming","background_color":"#E6FAE6","first_section_title":"웹3 게임도 웹2 게임의 문제점을 가지고 있다","first_section_desc_1":"2022년의 웹 3 게임 시장은 웹 2 게임 시장 초기의 문제점을 가지고 있습니다. 웹 3에서는 블록체인이 다양하다 보니 이더리움 게임, 폴리곤 게임, BNB게임 등 게임이 파편화되어 있고 게임이 나오더라도 잘 보이지 않아 게이머들은 디스코드, 텔레그램, 또는 트위터를 뒤져야 새로운 게임을 찾을 수 있습니다.","first_section_desc_2":"이러한 채널에서 공유되는 파일은 해킹에 취약하기도 합니다. 이러한 모습들은 게임 시디를 사러 용산 전자상가에 가거나 CD는 복사가 가능하다 보니 불법 이미지 파일이 공유되던 20년 전의 모습과 비슷합니다. 웹 2 게임 시장의 문제는 스팀이 나오면서 해결되기 시작했습니다.","first_section_image_source":"/images/page3-sec1.gif","second_section_title":"웹2 게임의 문제를 해결한 스팀","second_section_desc_1":"스팀은 사용자가 게임을 다운로드하고 설치하는 방법을 매우 심플화하도록 만들었으며 게임 패치가 있을 경우도 클릭 한 번으로 업데이트할 수 있습니다.","second_section_desc_2":"이로써 사용자는 스팀을 통해 게임을 사고 저장을 용이하게 할 수 있었으며 다양한 할인 이벤트로 사용자를 늘려나갔습니다. 스팀 안에서는 뉴스 또는 커뮤니티 측면에서의 기능도 활성화되어 현재는 1억 명이 넘게 사용하는 애플리케이션입니다.","second_section_image_source":"/images/page3-sec2.gif","third_section_title":"새로운 기회가 열린 웹3 게임 시장","third_section_desc_1":"스팀은 매우 잘 나가는 앱이 되었지만 웹 3의 문제점을 스팀이 해결하기는 어려워 보입니다. 규모가 너무 큰 탓에 골치 아픈 규제 문제를 풀어나가기보다는 배척하는 방법을 택했습니다. 현재 스팀의 정책으로는 P2E나 NFT 또는 크립토 게임은 스팀에 게임을 팔 수 없습니다.","third_section_desc_2":"게임 시장은 항상 새로운 기술이 첫 번째로 적용되는 시장입니다. NFT나 토큰을 사용하는 웹 3 기술이 게임에 빠르게 적용되었고 웹 3 게임의 잠재성도 보여주고 있지만 아직 스팀처럼 웹 3 게임의 파편화 및 불편함을 해결하는 웹 3 게임 플랫폼은 나오지 않고 있습니다.","third_section_image_source":"/images/page3-sec3.gif","fourth_section_title":"웹3 게임 플랫폼의 특징","fourth_section_desc_1":"스팀의 웹 3 버전은 몇 가지 기능이 특화될 것이라고 생각합니다. 첫 번째는 게이머들과의 게임 교환이 가능합니다. 20년 전의 게임 시디는 NFT화 돼서 게이머가 구매한 게임은 중앙화 된 플랫폼이 아니라 다시 게이머에게 돌아갑니다. 즉, 게이머들은 게임을 충분히 플레이하다가 다른 게임과의 교환이 가능합니다. 게임뿐만 아니라 NFT로 만들어진 아이템 또는 재화의 교환도 가능합니다.","fourth_section_desc_2":"두 번째는 게임의 데이터가 더 많이 활용할 수 있습니다. 스팀의 비디오 게임은 싱글 플레이이기 때문에 플레이할 때 저장되는 데이터는 한정적이지만 웹 3 기술인 블록체인을 사용하게 되는 경우 많은 데이터가 블록체인에 올라가기 때문에 다른 플레이어는 어떤 선택을 하고 있는지 어떤 아이템들을 들고 있는지 등의 데이터가 더욱 쉽게 보입니다. 마지막으로는 웹 2에는 사용되지 않던 토크 노믹스와 스테이 킹 등의 기능이 추가될 수 있습니다. 웹 3 게임 내의 재화나 아이템은 토큰화 될 예정이기 때문에 해당 토큰을 게임 바깥에서 사용하는 사용처도 플랫폼이 제공할 것으로 보입니다.","fourth_section_image_source":"/images/page3-sec4.gif","call_to_action_1":"Web3 게임인 포트리스 아레나를 만드는 저희는 순수하게 게임을 좋아하는 게이머들이 많이 필요합니다.","call_to_action_2":"웹3 게임 시장을 함께 만들어가실 분들은 디스코드에 참여해서 많은 의견 부탁드립니다."},"titles":["P2E는 끝났다?","크립토 게임은 언제 유명해지나요?","웹3 게임 시장에서의 스팀","2023년의 P2E 게임 트렌드","블록체인 게임의 다이나믹한 사이클"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Android-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}