{"pageProps":{"article":{"id":"1","lang":"en","title":"Is P2E Dead?","desc":"P2E games are the future and gamers need it","keywords":"game, games, web3, p2e, gamers, play to earn, token","path":"is-P2E-Dead","background_color":"#E9F3F9","first_section_title":"Play to Earn games are for gamers","first_section_desc_1":"P2E, which started with Axie infinity, has a view that P2E is over now as the number of users of Axie infinity decreases and the token price of AXS and SLP used in Axie infinity also goes down. However, in Web3 space, this view is often encountered. Is Bitcoin dead? Or is Ethereum over?","first_section_desc_2":"There are countless Web3 projects and concepts that have died in the middle, but many have survived to the end. Like projects that survived by overcoming twists and turns, trying new things and changing, we believe that P2E is a concept that will continue to change and survive in the future. Web3's P2E has better benefits for game players, not game companies.","second_section_title":"Wrong direction of P2E games","second_section_desc_1":"However, many of the current P2E projects are showing fraud and token price pumping and dumping, which is repulsive to gamers who play games passionately. Also, since many P2E games aim to earn more tokens and increase the price of tokens, there is a point where they are merged with the wrong Web3 culture.","second_section_desc_2":"Rocket images and To the Moon are everywhere within the game's communities on Discord and Telegram, but that's not where Web3 games should be headed. Adding Web3 features to richer gameplay in the fun games of Web2 is the next direction to go. For gamers, the most important thing is not tokens or NFTs, but games.","third_section_title":"P2E is not a new concept","third_section_desc_1":"P2E is actually a concept that existed in the existing game, Web2. In-game botting is created to earn money, and third-party apps are used to exchange items or in-game goods with others. In the case of MMORPGs, even if they are in-game goods that are not cashed in, they are played to earn materials for quests, and this can also be called P2E in a large frame. P2E itself is not a new concept, but the biggest reason Web3 P2E games came out was to decentralize the monopoly of games.","third_section_desc_2":"The player's exchange of goods is gradually disappearing, and the structure in which the game company exclusively owns the supplier of goods in the game and takes all the profits from the Mystery Box system is the biggest problem of current games, and this can be solved in Web3 games. It is the strength of Web3 that game companies and players grow together and improve the degree of freedom of game play through Web3 features, and we think game companies that add Web3 features well will create games that will lead the next game industry.","fourth_section_title":"What's next for P2E games?","fourth_section_desc_1":"No matter how well you add Web3 features, the most important thing is that the game should be fun. In essence, games must be fun so that gamers can become part of the game community and enjoy the added Web3 features with various forms of P2E. The community of Web3 P2E games should be filled with gamers who are more curious about the content of the next updated game, rather than people who are worried about how much to earn and lose.","fourth_section_desc_2":"P2E games in the future are not standardized games where you can go to a higher rank by spending more money, but we think the next step is for gamers to grow together as the game grows and to get back the right to supply goods in the game.돈을 더 많이 쓰면 상위 랭크로 갈 수 있는 획일화된 게임이 아니라 게이머도 게임이 성장할수록 같이 성장하며 게임 내의 재화의 공급 같은 권한도 게이머들이 다시 돌려받는 것이 다음 단계라고 생각합니다.","call_to_action_1":"Fortress Arena, a Web3 game, needs a lot of gamers who genuinely love the game.","call_to_action_2":"If you want to grow with us, please participate in the Discord and give us your opinions."},"titles":["Is P2E Dead?","When Cryptocurrency games become popular?","Next version of Steam in Web3 Gaming","P2E Game Trend in 2023","A Dynamic History of Blockchain Games"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Android-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}