{"pageProps":{"article":{"id":"4","lang":"en","title":"P2E Android Game Trend in 2023","path":"P2E-Android-Game-Trend-in-2023","background_color":"#FFEEDB","first_section_title":"Problems of existing P2E","first_section_desc":"As many P2E games are planned for release in 2023 as in 2022. However, the games that were launched in 2022 had their own limitations, so the games to be released in 2023 will come out by complementing many problems. Then, what problems did the existing P2E games have and how will they be solved in the new P2E games?","second_section_title":"Play with Social Login","second_section_desc":"The first section is more accessible. There are two major obstacles to accessibility in current P2E games. One is that you must own NFTs to play, and the other is that you need a wallet to own NFTs. In contrast to Android games where you can directly access the game by simply logging in with Google, I think P2E games in 2023 will change so that you can play the game directly with social login regardless of NFT. Games like Free to Play or Free to Rent will be transformed into games that will be as easy to play as existing games. Tokens or NFTs obtained while playing the game can be owned by creating a wallet while playing the game, not at the start of the game.","third_section_title":"Changes in NFT Supply","third_section_desc":"Second, the NFT supply method will change. The supply of characters in P2E games can be viewed positively in that the user has received the authority that the game company has exclusively because the user has the authority. However, the character supply method of P2E in 2022 is a breeding system where two parent characters create one child character. No matter how much you limit the number of breeding in this method, the number of characters increases exponentially over time, and the supply of more than the characters that users want to play occurs. Since the character is not unique, the fun is halved and the number of users is gradually decreasing, which is also a factor that shortens the life of the game. Therefore, in P2E in 2023, users have the right to supply, but I think the supply method of characters will diversify and new trends will emerge from it.","fourth_section_title":"The last puzzle of the P2E game","fourth_section_desc":"Lastly and obviously, the game should be fun. Existing P2E games are played to make money rather than for fun. There is also a tendency to call existing P2E games as game pie in the form of combining games with finance. The games that will be reorganized in 2023 will come out with a purpose for game rather than money. Regardless of NFTs and tokens, it refers to games where the number of players is increasing because the game is fun, and the number of players is high, so the game is fun, so they also purchase in-game items.","call_to_action":"We are making Fortress Arena, a Web3 game, and we need a lot of gamers who genuinely love the game. If you are interested in making Fortress Arena the P2E trending game of 2023, please join us on Discord and give us your opinions."},"titles":["Is P2E Dead?","When Cryptocurrency games become popular?","Next version of Steam in Web3 Gaming","P2E Android Game Trend in 2023","A Dynamic History of Blockchain Games"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Android-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}