{"pageProps":{"article":{"id":"2","lang":"en","title":"When Cryptocurrency games become popular?","path":"When-Cryptocurrency-Games-Become-Popular","background_color":"#FAE6E6","first_section_title":"Crypto game that does well","first_section_desc":"In the crypto market, when Bitcoin or Ethereum drops significantly, almost all coins tend to fall. Currently, the crypto market is experiencing a drop in many coins, so the coin on the Web3 game side is also in a bad situation. But the market as a whole is not dead. According to DappRadar reports, Alien Worlds had close to 200,000 players in Q3, while gaming platform Gameta has nearly 2 million users. It's just that the number of gamers is not as high as that of Web2 games, and the expansion of gamers is not as fast.","second_section_title":"Crypto Game Market Attention","second_section_desc":"This is due to the lack of Web3 gamers, and the biggest reason is that the current cryptocurrency games do not provide enough quality or fun to attract gamers. Although it is a Web3 game that does not provide good quality right now, I believe that blockchain will take game play to the next level in the future, just as the Internet has moved from single player to multiplayer game. For this reason, many crypto venture capitalists are paying attention to Web3 games, and many blockchain companies are participating in game conferences.","third_section_title":"Number of Investors > Number of Gamers","third_section_desc":"A lot of money is currently flowing into Web3 gaming, and many game companies and game studios are investing and launching to create the games of the future. The Web3 gaming market has plenty of capital, but it lacks the most important gamers. To exaggerate, there are more investors than gamers.","fourth_section_title":"Crypto Games in 2023","fourth_section_desc":"If high-quality games using blockchain come out, we will definitely see many gamers in the Web3 game market. Of course, there are limitations of blockchain that need to be addressed before that. And it should be easier to create an account on the blockchain that owns the items received in the game. On the blockchain, we are solving technical limitations one by one that gamers will not feel uncomfortable with, and many things can be solved in 2023, so I think we may see the trend of crypto games in 2023.","call_to_action":"We are making Fortress Arena, a Web3 game, and we need a lot of gamers who genuinely love the game. If you are interested in solving technical limitations together, please participate in the Discord and give your opinions.","sources":"https://dappradar.com/blog/dappradar-x-bga-games-report-q3-2022"},"titles":["Is P2E Dead?","When Cryptocurrency games become popular?","Next version of Steam in Web3 Gaming","P2E Android Game Trend in 2023","A Dynamic History of Blockchain Games"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Android-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}