{"pageProps":{"article":{"id":"5","lang":"en","title":"A Dynamic History of Blockchain Games","desc":"Bitcoin games & Ethreum games' history and what is next?","keywords":"game, blockchain, games, crypto, market, ethereum games, bitcoin games, Crypto Kitty, Axie Infinity, Hunter Coin","path":"A-Dynamic-History-of-Blockchain-Games","background_color":"#FFF1FF","first_section_title":"The real first blockchain game","first_section_desc_1":"Blockchain games have a longer history than you might think. When many people think of blockchain games, they think of Axie Infinity or Crypto Kitty. However, it was Hunter Coin that came out in 2014 that started the blockchain game. Hunter Coin is very similar to Bitcoin, but with one difference, Hunter Coin only goes 10% back to the miners and 90% goes to the game. The rule of the game was for game players to compete with other players in the game to obtain Hunter Coins, and it was a Bitcoin version of the game that once went well, with up to about 30,000 players.","first_section_desc_2":"However, the gameplay was too simple, so it was easy for bots to work, and there was a downside that players couldn't constantly come in. After that, the life of the game ended and the crypto market also entered a dark period, and people thought that the crypto market would disappear, and they stopped looking for blockchain games for a while.","second_section_title":"The first NFT blockchain game to utilize","second_section_desc_1":"After 2014, Ethereum came out and platform blockchain was introduced, resulting in FT and NFT. In particular, due to the non-replaceable nature of NFT, there was a lot of movement to use it in games, and several Ethereum games came out. However, the most famous one came out at the end of 2017, when a crypto kitty game that uses cat character NFTs to play a breeding game came out.","second_section_desc_2":"The game itself was simple and its popularity quickly waned, but it had a great impact on the crypto market, considering that the maximum number of users per day is over 14,000 and that Crypto Kitty's breeding system still exists. The Crypto Kitty game is still alive, but it is not a game that is currently played a lot due to the lack of development of the game.","third_section_title":"Full-fledged blockchain game","third_section_desc_1":"The crypto market is only revitalized two years after another crisis in 2018. With the technology called NFT becoming more known to the public and technologies utilizing the stability of Ethereum emerging, Axie Infinity, which came out with a model called P2E, played a leading role in ths last cycle of blockchain games. After Axie Infinity, many game companies began to announce the entry of blockchain, and games with a model of earning tokens by performing specific actions such as X2E  (eg M2E) came out.","third_section_desc_2":"However, Axie Infinity also had weaknesses like existing blockchain games, and failed to overcome its weaknesses to bring continuous gamers to the game. At the same time, the price of Bitcoin and Ethereum has fallen so much that the market is not looking for crypto games again.","fourth_section_title":"The Next Blockchain Game?","fourth_section_desc_1":"It seems to have a similar cycle with a new blockchain game coming out every few years, but it's getting better in many respects. It is evolving to be more and more compatible with blockchain in games, and the quality of games and player aspects are also evolving.","fourth_section_desc_2":"The current bad coin market is a great time to find a new blockchain game. We will witness another trend of blockchain games in the year when the decline of the crypto market stops and becomes active again.","call_to_action_1":"We, Fortress Arena team, need a lot of gamers who genuinely love the game.","call_to_action_2":"If you are interested in making the next blockchain game together, please join us on Discord and give us your opinions."},"titles":["Is P2E Dead?","When Cryptocurrency games become popular?","Next version of Steam in Web3 Gaming","P2E Game Trend in 2023","A Dynamic History of Blockchain Games"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Android-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}