{"pageProps":{"article":{"id":"3","lang":"en","title":"Next version of Steam in Web3 Gaming","path":"Next-Version-of-Steam-in-Web3-Gaming","background_color":"#E6FAE6","first_section_title":"Web3 games also have problems with web2 games.","first_section_desc_1":"The web 3 game market in 2022 has problems with the early web 2 game market. In Web 3, since blockchains are diverse, games such as Ethereum games, polygon games, and BNB games are fragmented, and even when games are released, they are not easily visible, so gamers can find new games only by searching Discord, Telegram, or Twitter.","first_section_desc_2":"Files shared on these channels are also vulnerable to hacking. This look is similar to what it looked like 20 years ago when you went to a retail shop to buy a game CD, or illegal image files were shared because CDs could be copied. The problems in the web 2 game market began to be resolved with the release of Steam.","second_section_title":"Steam solved the problem of web2 games","second_section_desc_1":"Steam has made it very simple for users to download and install games, and if a game patch is available, it can be updated with a single click.","second_section_desc_2":"This allowed users to easily save and buy games through Steam, and increased users through various discount events. In Steam, news or community features are also activated, and it is currently an application used by over 100 million people.","third_section_title":"Web3 game market opens up new opportunities","third_section_desc_1":"Steam has become a very popular app, but it seems difficult for Steam to solve the problems of Web 3. Because it is so large, it has chosen to ostracize rather than solve its vexing regulatory problems. Steam's current policy is that P2E, NFT or crypto games cannot be sold on Steam.","third_section_desc_2":"The gaming market is always the first market for new technologies. Web 3 technologies using NFTs or tokens have been quickly applied to games, and the potential of web 3 games is also showing, but there is no web 3 game platform that solves the fragmentation and inconvenience of web 3 games like Steam.","fourth_section_title":"Characteristics of the web3 gaming platform","fourth_section_desc_1":"Steam's Web 3 version will specialize in a few features. The first is game exchange with gamers. Game CDs from 20 years ago became NFTs, so games purchased by gamers are returned to gamers instead of saving in a centralized platform. In other words, gamers can exchange for other games after playing enough. In addition to games, items or goods made with NFTs can be exchanged.","fourth_section_desc_2":"The second is that the game's data is more usable. Since Steam's video games are mostly for single-player, the data stored from playing is limited, but when using the blockchain, a web 3 technology, a lot of data is uploaded to the blockchain, so you can see what choices other players are making and what items they are holding. etc. is easier to see. Finally, features such as tokenomics and staking that were not used in Web 2 may be added. Since goods and items within Web 3 games will be tokenized, the platform will also provide ways to use the tokens outside the game.","call_to_action":"We, Fortress Arena taem, need a lot of gamers who genuinely love the game. If you want to create the web 3 game market together, please join us on Discord and give us your opinions."},"titles":["Is P2E Dead?","When Cryptocurrency games become popular?","Next version of Steam in Web3 Gaming","P2E Game Trend in 2023","A Dynamic History of Blockchain Games"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Android-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}