{"pageProps":{"article":{"id":"1","lang":"en","title":"Is P2E Dead?","path":"is-P2E-Dead","background_color":"#E9F3F9","first_section_title":"Play to Earn games are for gamers","first_section_desc":"P2E, which started with Exy Infinity, has a view that P2E is over now as the number of users of Exy Infinity and the token price of AXS and SLP used in Exy Infinity are also decreasing. However, in Web3, which deals with blockchain, this view is often encountered. Is Bitcoin Over? Or is Ethereum over? Web3 has tons of halfway projects and concepts, but a lot of them live on. I think P2E is a concept that will continue to be used in the future, just as we survived by overcoming twists and turns and trying new things and changing. Because Web3's P2E has better benefits for game players, not game companies.","second_section_title":"The Wrong Direction of P2E Games","second_section_desc":"However, many of the projects currently using P2E show endless scams and token price pumping before selling them to the market, which is repulsive to passionate gamers. Also, since many P2E games aim to earn more tokens and increase the price of tokens, there is a point where they are merged with the wrong Web3 culture. Rocket images and Gazza are chanting within the game's communities on Discord and Telegram, but that's not where Web3 games should be headed. Adding Web3 features to richer gameplay in the fun games of Web2 is the next direction to go. For gamers, the most important thing is the game, not tokens or NFTs.","third_section_title":"P2E is not a new concept","third_section_desc":"P2E is actually a concept that existed in the previous game, Web2. In-game workshops are created to earn money, and third-party apps are used to exchange items or in-game goods with others. In the case of MMORPGs, even if they are in-game goods that are not cashed in, they are played to earn materials for quests, and this can also be called P2E in a large frame. P2E itself is not a new concept, but I think the biggest reason Web3 P2E games came out was to decentralize the monopoly of games. The player's exchange of goods is gradually disappearing, and the structure in which the game company exclusively owns the supplier of goods in the game and enjoys all the profits from the gacha system is the biggest problem of current games, and this can be solved in Web3 games. It is the strength of Web3 that game companies and players grow together and improve the degree of freedom of game play through Web3 features, and I think game companies that add Web3 features well will create games that connect the next game industry.","fourth_section_title":"What's next for P2E games?","fourth_section_desc":"No matter how well you add Web3 features, the most important thing is that the game is fun. In essence, games must be fun so that gamers can become part of the game community and enjoy the added Web3 features while also enabling various forms of P2E. The community of Web3 P2E games should be filled with gamers who are more curious about the content of the next updated game, rather than people who are worried about how much to earn and lose. It's not a standardized game where you can go to a higher rank if you spend more money, but gamers grow as the game grows, and I think the next step is for gamers to get their rights back, such as the supply of goods in the game.","call_to_action":"We are making Fortress Arena, a Web3 game, and we need a lot of gamers who genuinely love the game. If you would like to grow with us, please participate in the Discord and give us your opinions."},"titles":["Is P2E Dead?","When Cryptocurrency games become popular?","Next version of Steam in Web3 Gaming","P2E Android Game Trend in 2023","A Dynamic History of Blockchain Games"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Android-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}