{"pageProps":{"article":{"id":"1","lang":"kr","title":"P2E는 끝났다?","path":"is-P2E-Dead","background_color":"#E9F3F9","first_section_title":"Play to Earn 게임은 게이머를 위한 것","first_section_desc_1":"엑시 인피니티로 시작된 P2E는 엑시 인피니티의 사용자 수가 급감하고 엑시 인피니티에서 사용된 AXS와 SLP의 토큰 가격도 내려감에 따라 P2E도 이제 끝난 게 아니냐는 시각이 존재합니다. 하지만 블록체인을 다루는 Web3에서는 이런 시각을 자주 마주합니다. 비트코인은 끝났나? 혹은 이더리움은 끝났나?라는 말을 자주 듣지만 아직 잘 작동하고 있는 프로젝트들입니다.","first_section_desc_2":"Web3에는 중간에 끝난 프로젝트와 개념도 무수히 많지만 끝까지 살아남은 것들도 매우 많습니다. 중간에 우여곡절을 이겨내고 새롭게 시도하고 변화하면서 살아남은 것처럼 P2E도 앞으로 계속해서 사용될 개념이라고 생각합니다. Web3의 P2E는 게임사가 아니라 게임 플레이어에게 더 좋은 이점들이 있기 때문입니다.","second_section_title":"P2E 게임의 잘못된 방향","second_section_desc_1":"하지만 현재의 P2E를 사용하는 많은 프로젝트들 중에는 끊임없는 사기와 토큰의 가격 펌핑 후 시장에 내다 파는 행위들을 보여주고 있어 게임을 열정적으로 플레이하는 게이머들에게 반감을 사고 있습니다. 또한 많은 P2E게임은 더 많은 토큰을 벌고 토큰의 가격이 오르는 게 목적이다 보니 잘못된 Web3 문화랑 합쳐진 지점이 있습니다.","second_section_desc_2":"디스코드와 텔레그램 같은 게임의 커뮤니티 내에선 로켓 이미지와 가즈아를 외치고 있지만 Web3 게임이 향해야 하는 방향은 그곳이 아닙니다. Web2의 재밌는 게임에서 Web3의 기능을 추가해 게임 플레이를 더 풍부하게 만들어 주는 것이 나아가야 할 다음 방향입니다. 게이머에게 가장 중요한 것은 토큰이나 NFT가 아니라 게임입니다.","third_section_title":"P2E가 새로운 개념은 아니다","third_section_desc_1":"P2E는 사실 기존의 게임인 Web2에서도 있었던 개념입니다. 게임 내에서 돈을 벌기 위한 작업장이 만들어지기도 하고 타인과 아이템 또는 게임 내의 재화를 교환하려고 써드파티 앱을 사용하기도 합니다. MMORPG의 경우 비록 현금화가 되지 않는 게임 내의 재화여도 퀘스트를 진행하기 위한 재료를 벌기 위해 플레이하며 이것도 큰 틀에서의 P2E라고 할 수 있습니다. P2E 자체는 새로운 개념이 아니지만 Web3 P2E 게임이 나온 가장 큰 이유는 게임의 독점을 분산시키기 위해 시작되었다고 생각합니다.","third_section_desc_2":"플레이어의 재화 교환은 점점 없어져서 게임 내의 재화 공급자는 게임사가 독점적으로 가지고 있고 가챠시스템으로 이익은 전부 게임사가 누리는 구조는 현재 게임의 가장 큰 문제인데 이 것은 Web3 게임에서 해결될 수 있습니다. 게임사와 플레이어가 같이 성장하고 Web3 기능을 통해 게임 플레이의 자유도를 향상하는 것은 Web3의 강점이며 Web3기능을 잘 추가하는 게임사들은 다음 게임 산업을 잇는 게임들을 만들어 낼 것이라고 생각합니다.","fourth_section_title":"P2E 게임의 다음은?","fourth_section_desc_1":"아무리 Web3기능을 잘 추가한다고 하더라도 가장 중요한 것은 게임이 재밌어야 합니다. 본질적으로 게임이 재미있어야 게이머들이 게임 커뮤니티의 일원이 되고 추가된 Web3기능을 즐기면서 다양한 형태의 P2E도 가능합니다. Web3 P2E 게임의 커뮤니티는 얼마큼 벌고 빠져야지라는 고민을 하는 사람들로 채워지기보다는 다음 업데이트되는 게임의 콘텐츠가 더 궁금한 게이머들로 채워져야 합니다.","fourth_section_desc_2":"돈을 더 많이 쓰면 상위 랭크로 갈 수 있는 획일화된 게임이 아니라 게이머도 게임이 성장할수록 같이 성장하며 게임 내의 재화의 공급 같은 권한도 게이머들이 다시 돌려받는 것이 다음 단계라고 생각합니다.","call_to_action":"Web3 게임인 포트리스 아레나를 만드는 저희는 순수하게 게임을 좋아하는 게이머들이 많이 필요합니다. 저희와 함께 성장하실분은 디스코드에 참여해서 많은 의견 부탁드립니다."},"titles":["P2E는 끝났다?","크립토 게임은 언제 유명해지나요?","웹3 게임 시장에서의 스팀","2023년의 P2E 게임 트렌드","블록체인 게임의 다이나믹한 사이클"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}