{"pageProps":{"article":{"id":"4","lang":"kr","title":"2023년의 P2E 게임 트렌드","path":"P2E-Game-Trend-in-2023","background_color":"#FFEEDB","first_section_title":"기존 P2E의 문제점","first_section_desc_1":"2022년만큼이나 2023년에도 다양한 P2E 게임들이 출시될 계획입니다. 하지만 2022년에 론칭되었던 게임들은 저마다의 한계를 가지고 있었기 때문에 2023년에 출시할 게임들은 많은 문제점을 보완해서 나올 예정입니다.","first_section_desc_2":"그러면 기존의 P2E게임에는 어떤 문제가 있었고 새로운 P2E게임에서는 어떻게 해결될까요?","second_section_title":"소셜 로그인으로 플레이","second_section_desc_1":"첫 번째는 접근성이 높아집니다. 현재의 P2E 게임은 크게 두 가지가 접근성을 방해합니다. 하나는 NFT를 소유해야 플레이가 가능하다는 점과 다른 하나는 NFT를 소유할 지갑이 필요하다는 점입니다. 안드로이드 게임에서는 구글 로그인만 하면 게임으로 바로 접근할 수 있는 것과 대비되기 때문에 2023년의 P2E게임에서는 NFT와 관계없이 소셜 로그인으로 바로 게임을 플레이할 수 있도록 변화할 것이라고 생각합니다.","second_section_desc_2":"Free to Play 또는 Free to Own 같은 식의 게임으로 변화해 기존 게임처럼 쉽게 플레이할 수 있는 게임들이 나올 예정입니다. 게임을 하면서 얻는 토큰이나 NFT들은 게임을 시작할 때가 아니라 게임을 플레이하는 도중에 지갑을 만들어서 소유할 수 있습니다.","third_section_title":"NFT 공급의 변화","third_section_desc_1":"두 번째는 NFT 공급 방식이 변화됩니다. P2E 게임의 캐릭터 공급은 사용자가 권한을 가지기 때문에 게임사가 독점적으로 가진 권한을 사용자가 받았다는 점에서 긍정적으로 볼 수 있습니다. 하지만 2022년의 P2E의 캐릭터 공급 방식은 브리딩 시스템으로 2개의 부모 캐릭터가 1개의 자식 캐릭터를 만드는 방식입니다. 이 방식에서 아무리 브리딩의 숫자를 제한한다 하더라도 시간이 지나면 캐릭터의 숫자가 기하급수적으로 증가하게 되고 플레이하는 사용자들이 원하는 캐릭터보다 더 많이 공급이 일어나게 됩니다.","third_section_desc_2":"캐릭터의 유니크함이 없으니 재미는 반감되고 사용자 수는 점점 줄어 게임의 수명을 단축시키는 요인이기도 합니다. 따라서 2023년의 P2E는 그대로 사용자가 공급의 권한을 가지지만 캐릭터의 공급 방식이 다양해지고 그 안에서 새로운 트렌드가 나올 것이라고 생각합니다.","fourth_section_title":"P2E게임의 마지막 퍼즐","fourth_section_desc_1":"마지막으로는 당연한 이야기지만 게임이 재미있어야 합니다. 기존의 P2E게임은 재미로 플레이했다기보다 돈을 벌기 위해 플레이 한 측면이 있습니다. 금융에 게임을 접목시킨 형태로 기존의 P2E게임을 게임 파이(GameFi)로 부르는 경향도 있습니다.","fourth_section_desc_2":"2023년에 재정비를 하고 나올 게임들은 돈보다는 게임성에 목적을 두고 나올 예정입니다. NFT와 토큰에 관계없이 게임이 재밌어서 플레이어가 늘어나고 플레이어 수가 많고 게임이 재미있으니 인게임 내의 아이템도 구매하는 게임들을 말합니다.","call_to_action":"Web3 게임인 포트리스 아레나를 만드는 저희는 순수하게 게임을 좋아하는 게이머들이 많이 필요합니다. 포트리스 아레나를 2023년의 P2E 안드로이드 트렌드 게임으로 함께 만들어 가실 분들은 디스코드에 참여해서 많은 의견 부탁드립니다."},"titles":["P2E는 끝났다?","크립토 게임은 언제 유명해지나요?","웹3 게임 시장에서의 스팀","2023년의 P2E 게임 트렌드","블록체인 게임의 다이나믹한 사이클"],"paths":["is-P2E-Dead","When-Cryptocurrency-Games-Become-Popular","Next-Version-of-Steam-in-Web3-Gaming","P2E-Game-Trend-in-2023","A-Dynamic-History-of-Blockchain-Games"]},"__N_SSG":true}